#### 🏗️ Infrastructure Terraform Plan

**Status:** `success`

<details><summary>📋 Show Plan</summary>

```terraform
data.aws_iam_role.lab_role: Reading...
aws_ecr_repository.payments: Refreshing state... [id=tech-challenge-payments]
aws_vpc.main: Refreshing state... [id=vpc-028a6e5c7dd948da2]
aws_ecr_repository.orders: Refreshing state... [id=tech-challenge-orders]
aws_lb_target_group_attachment.eks_nodes[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:708967422583:targetgroup/tech-challenge-nginx-tg/8383be0175643323-20260109140202876400000001]
aws_lb_target_group_attachment.eks_nodes[1]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:708967422583:targetgroup/tech-challenge-nginx-tg/8383be0175643323-20260109140202896300000002]
aws_ecr_repository.customer: Refreshing state... [id=tech-challenge-customer]
aws_lb_target_group.eks_services: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:708967422583:targetgroup/tech-challenge-eks-tg/f40dcd55a001bf6e]
data.aws_caller_identity.current: Reading...
aws_cognito_user_pool.main: Refreshing state... [id=us-east-1_eAJCZr0PD]
data.aws_caller_identity.current: Read complete after 1s [id=708967422583]
data.aws_iam_role.lab_role: Read complete after 1s [id=LabRole]
aws_ecr_lifecycle_policy.payments: Refreshing state... [id=tech-challenge-payments]
aws_ecr_lifecycle_policy.customer: Refreshing state... [id=tech-challenge-customer]
aws_ecr_lifecycle_policy.orders: Refreshing state... [id=tech-challenge-orders]
aws_cognito_user_pool_domain.main: Refreshing state... [id=tech-challenge-708967422583]
aws_cognito_user_pool_client.main: Refreshing state... [id=6lm0kiljg87c78lqmbv7kketgi]
aws_internet_gateway.main: Refreshing state... [id=igw-0a7ea2a0f21ba3506]
aws_subnet.private[1]: Refreshing state... [id=subnet-04bccc45cc63dbaa9]
aws_subnet.public[1]: Refreshing state... [id=subnet-0566f2e72b1eef32c]
aws_subnet.private[0]: Refreshing state... [id=subnet-08366bdf946d78c00]
aws_subnet.public[0]: Refreshing state... [id=subnet-00807de4031c033f5]
aws_security_group.eks_cluster: Refreshing state... [id=sg-09b0d67d439566271]
aws_security_group.nlb: Refreshing state... [id=sg-04ad870cb1d4a4f2b]
aws_lb_target_group.nginx_ingress: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:708967422583:targetgroup/tech-challenge-nginx-tg/8383be0175643323]
aws_eip.nat: Refreshing state... [id=eipalloc-0a46c0c51b068e8e9]
aws_route_table.public: Refreshing state... [id=rtb-07fcdf59c787945e8]
aws_eks_cluster.main: Refreshing state... [id=tech-challenge-cluster]
aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:708967422583:loadbalancer/net/tech-challenge-nlb/32d2260d89dcae2d]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0c4f74b9605ac0801]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0f53a15fc1f96e92c]
aws_nat_gateway.main: Refreshing state... [id=nat-018e1e03ff1a81b70]
aws_route_table.private: Refreshing state... [id=rtb-07f695cb9033cbdc5]
aws_eks_node_group.main: Refreshing state... [id=tech-challenge-cluster:tech-challenge-node-group]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-01b204a242d9b6dbc]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-08f937d6323fed744]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:708967422583:listener/net/tech-challenge-nlb/32d2260d89dcae2d/9f5a6399f21e0d64]
kubernetes_namespace.ingress_nginx: Refreshing state... [id=ingress-nginx]
kubernetes_ingress_class.nginx: Refreshing state... [id=nginx]
data.kubernetes_namespace.existing: Reading...
data.kubernetes_namespace.existing: Read complete after 1s [id=tech-challenge]
kubernetes_config_map.ingress_nginx: Refreshing state... [id=ingress-nginx/ingress-nginx-controller]
kubernetes_service_account.ingress_nginx: Refreshing state... [id=ingress-nginx/ingress-nginx]
kubernetes_service.ingress_nginx_controller: Refreshing state... [id=ingress-nginx/ingress-nginx-controller]
kubernetes_deployment.ingress_nginx_controller: Refreshing state... [id=ingress-nginx/ingress-nginx-controller]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # aws_cloudwatch_dashboard.main will be created
  + resource "aws_cloudwatch_dashboard" "main" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + widgets = [
                  + {
                      + height     = 1
                      + properties = {
                          + markdown = <<-EOT
                                # 🎯 Tech Challenge - Dashboard de Monitoramento
                                **Cluster:** tech-challenge-cluster | **Região:** us-east-1
                            EOT
                        }
                      + type       = "text"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 2
                      + properties = {
                          + markdown = <<-EOT
                                ## 📊 Status Geral
                                Para verificar o status atual, use:
                                ```
                                aws eks describe-cluster --name tech-challenge-cluster
                                ```
                            EOT
                        }
                      + type       = "text"
                      + width      = 8
                      + x          = 0
                      + y          = 1
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "ContainerInsights",
                                  + "node_cpu_utilization",
                                  + "ClusterName",
                                  + "tech-challenge-cluster",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                            ]
                          + region  = "us-east-1"
                          + title   = "🖥️ CPU dos Nodes (%)"
                          + view    = "timeSeries"
                          + yAxis   = {
                              + left = {
                                  + max = 100
                                  + min = 0
                                }
                            }
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 0
                      + y          = 3
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "ContainerInsights",
                                  + "node_memory_utilization",
                                  + "ClusterName",
                                  + "tech-challenge-cluster",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                            ]
                          + region  = "us-east-1"
                          + title   = "🧠 Memória dos Nodes (%)"
                          + view    = "timeSeries"
                          + yAxis   = {
                              + left = {
                                  + max = 100
                                  + min = 0
                                }
                            }
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 12
                      + y          = 3
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "ContainerInsights",
                                  + "pod_number_of_running_containers",
                                  + "ClusterName",
                                  + "tech-challenge-cluster",
                                  + {
                                      + period = 60
                                      + stat   = "Sum"
                                    },
                                ],
                            ]
                          + region  = "us-east-1"
                          + title   = "🐳 Containers Rodando"
                          + view    = "singleValue"
                        }
                      + type       = "metric"
                      + width      = 8
                      + x          = 0
                      + y          = 9
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "ContainerInsights",
                                  + "pod_cpu_utilization",
                                  + "ClusterName",
                                  + "tech-challenge-cluster",
                                  + "Namespace",
                                  + "tech-challenge",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                            ]
                          + region  = "us-east-1"
                          + title   = "⚡ CPU Pods tech-challenge"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 8
                      + x          = 8
                      + y          = 9
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "ContainerInsights",
                                  + "pod_memory_utilization",
                                  + "ClusterName",
                                  + "tech-challenge-cluster",
                                  + "Namespace",
                                  + "tech-challenge",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                            ]
                          + region  = "us-east-1"
                          + title   = "💾 Memória Pods tech-challenge"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 8
                      + x          = 16
                      + y          = 9
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query  = "SOURCE '/tech-challenge/applications' | fields @timestamp, @message | sort @timestamp desc | limit 50"
                          + region = "us-east-1"
                          + title  = "📋 Logs Recentes das Aplicações"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 15
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "ContainerInsights",
                                  + "node_network_total_bytes",
                                  + "ClusterName",
                                  + "tech-challenge-cluster",
                                  + {
                                      + period = 300
                                      + stat   = "Sum"
                                    },
                                ],
                            ]
                          + region  = "us-east-1"
                          + title   = "🌐 Tráfego de Rede (bytes)"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 0
                      + y          = 21
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "ContainerInsights",
                                  + "node_filesystem_utilization",
                                  + "ClusterName",
                                  + "tech-challenge-cluster",
                                  + {
                                      + period = 300
                                      + stat   = "Average"
                                    },
                                ],
                            ]
                          + region  = "us-east-1"
                          + title   = "💿 Uso de Disco (%)"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 12
                      + y          = 21
                    },
                ]
            }
        )
      + dashboard_name = "TechChallenge-Dashboard"
      + id             = (known after apply)
      + region         = "us-east-1"
    }

  # aws_cloudwatch_log_group.applications will be created
  + resource "aws_cloudwatch_log_group" "applications" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/tech-challenge/applications"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + retention_in_days           = 7
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "production"
          + "Name"        = "tech-challenge-app-logs"
        }
      + tags_all                    = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "tech-challenge-app-logs"
          + "Project"     = "TechChallenge"
        }
    }

  # aws_cloudwatch_log_group.customer_service will be created
  + resource "aws_cloudwatch_log_group" "customer_service" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/tech-challenge/customer-service"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + retention_in_days           = 7
      + skip_destroy                = false
      + tags                        = {
          + "Name"    = "customer-service-logs"
          + "Service" = "customer"
        }
      + tags_all                    = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "customer-service-logs"
          + "Project"     = "TechChallenge"
          + "Service"     = "customer"
        }
    }

  # aws_cloudwatch_log_group.eks_cluster will be created
  + resource "aws_cloudwatch_log_group" "eks_cluster" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/eks/tech-challenge-cluster/cluster"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + retention_in_days           = 7
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "production"
          + "Name"        = "tech-challenge-eks-logs"
        }
      + tags_all                    = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "tech-challenge-eks-logs"
          + "Project"     = "TechChallenge"
        }
    }

  # aws_cloudwatch_log_group.orders_service will be created
  + resource "aws_cloudwatch_log_group" "orders_service" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/tech-challenge/orders-service"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + retention_in_days           = 7
      + skip_destroy                = false
      + tags                        = {
          + "Name"    = "orders-service-logs"
          + "Service" = "orders"
        }
      + tags_all                    = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "orders-service-logs"
          + "Project"     = "TechChallenge"
          + "Service"     = "orders"
        }
    }

  # aws_cloudwatch_log_group.payments_service will be created
  + resource "aws_cloudwatch_log_group" "payments_service" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/tech-challenge/payments-service"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + retention_in_days           = 7
      + skip_destroy                = false
      + tags                        = {
          + "Name"    = "payments-service-logs"
          + "Service" = "payments"
        }
      + tags_all                    = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "payments-service-logs"
          + "Project"     = "TechChallenge"
          + "Service"     = "payments"
        }
    }

  # aws_cloudwatch_metric_alarm.high_cpu will be created
  + resource "aws_cloudwatch_metric_alarm" "high_cpu" {
      + actions_enabled                       = true
      + alarm_description                     = "CPU dos nodes acima de 80%"
      + alarm_name                            = "tech-challenge-high-cpu"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "tech-challenge-cluster"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "node_cpu_utilization"
      + namespace                             = "ContainerInsights"
      + period                                = 300
      + region                                = "us-east-1"
      + statistic                             = "Average"
      + tags                                  = {
          + "Name" = "tech-challenge-cpu-alarm"
        }
      + tags_all                              = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "tech-challenge-cpu-alarm"
          + "Project"     = "TechChallenge"
        }
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.high_memory will be created
  + resource "aws_cloudwatch_metric_alarm" "high_memory" {
      + actions_enabled                       = true
      + alarm_description                     = "Memória dos nodes acima de 85%"
      + alarm_name                            = "tech-challenge-high-memory"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "tech-challenge-cluster"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "node_memory_utilization"
      + namespace                             = "ContainerInsights"
      + period                                = 300
      + region                                = "us-east-1"
      + statistic                             = "Average"
      + tags                                  = {
          + "Name" = "tech-challenge-memory-alarm"
        }
      + tags_all                              = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "tech-challenge-memory-alarm"
          + "Project"     = "TechChallenge"
        }
      + threshold                             = 85
      + treat_missing_data                    = "missing"
    }

  # aws_eks_addon.cloudwatch_observability will be created
  + resource "aws_eks_addon" "cloudwatch_observability" {
      + addon_name                  = "amazon-cloudwatch-observability"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "tech-challenge-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + region                      = "us-east-1"
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + service_account_role_arn    = "arn:aws:iam::708967422583:role/LabRole"
      + tags_all                    = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "TechChallenge"
        }
    }

  # aws_eks_addon.coredns will be created
  + resource "aws_eks_addon" "coredns" {
      + addon_name                  = "coredns"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "tech-challenge-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + region                      = "us-east-1"
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "TechChallenge"
        }
    }

  # aws_eks_addon.kube_proxy will be created
  + resource "aws_eks_addon" "kube_proxy" {
      + addon_name                  = "kube-proxy"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "tech-challenge-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + region                      = "us-east-1"
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "TechChallenge"
        }
    }

  # aws_eks_addon.vpc_cni will be created
  + resource "aws_eks_addon" "vpc_cni" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "tech-challenge-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + region                      = "us-east-1"
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "TechChallenge"
        }
    }

  # aws_eks_cluster.main will be updated in-place
  ~ resource "aws_eks_cluster" "main" {
      ~ enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
        id                            = "tech-challenge-cluster"
        name                          = "tech-challenge-cluster"
        tags                          = {}
        # (13 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = "arn:aws:elasticloadbalancing:us-east-1:708967422583:loadbalancer/net/tech-challenge-nlb/32d2260d89dcae2d"
      + port                                                                  = 80
      + protocol                                                              = "TCP"
      + region                                                                = "us-east-1"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "TechChallenge"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:708967422583:targetgroup/tech-challenge-nginx-tg/8383be0175643323"
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # aws_lb_target_group_attachment.eks_nodes[0] will be destroyed
  # (because aws_lb_target_group_attachment.eks_nodes is not in configuration)
  - resource "aws_lb_target_group_attachment" "eks_nodes" {
      - id               = "arn:aws:elasticloadbalancing:us-east-1:708967422583:targetgroup/tech-challenge-nginx-tg/8383be0175643323-20260109140202876400000001" -> null
      - port             = 30080 -> null
      - region           = "us-east-1" -> null
      - target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:708967422583:targetgroup/tech-challenge-nginx-tg/8383be0175643323" -> null
      - target_id        = "i-064b10db7d85a923c" -> null
    }

  # aws_lb_target_group_attachment.eks_nodes[1] will be destroyed
  # (because aws_lb_target_group_attachment.eks_nodes is not in configuration)
  - resource "aws_lb_target_group_attachment" "eks_nodes" {
      - id               = "arn:aws:elasticloadbalancing:us-east-1:708967422583:targetgroup/tech-challenge-nginx-tg/8383be0175643323-20260109140202896300000002" -> null
      - port             = 30080 -> null
      - region           = "us-east-1" -> null
      - target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:708967422583:targetgroup/tech-challenge-nginx-tg/8383be0175643323" -> null
      - target_id        = "i-0478a349ef9d82e3e" -> null
    }

  # kubernetes_cluster_role.ingress_nginx will be created
  + resource "kubernetes_cluster_role" "ingress_nginx" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/name" = "ingress-nginx"
            }
          + name             = "ingress-nginx"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "configmaps",
              + "endpoints",
              + "nodes",
              + "pods",
              + "secrets",
              + "namespaces",
            ]
          + verbs      = [
              + "list",
              + "watch",
            ]
        }
      + rule {
          + api_groups = [
              + "coordination.k8s.io",
            ]
          + resources  = [
              + "leases",
            ]
          + verbs      = [
              + "list",
              + "watch",
            ]
        }
      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "nodes",
            ]
          + verbs      = [
              + "get",
            ]
        }
      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "services",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
      + rule {
          + api_groups = [
              + "networking.k8s.io",
            ]
          + resources  = [
              + "ingresses",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "events",
            ]
          + verbs      = [
              + "create",
              + "patch",
            ]
        }
      + rule {
          + api_groups = [
              + "networking.k8s.io",
            ]
          + resources  = [
              + "ingresses/status",
            ]
          + verbs      = [
              + "update",
            ]
        }
      + rule {
          + api_groups = [
              + "networking.k8s.io",
            ]
          + resources  = [
              + "ingressclasses",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
      + rule {
          + api_groups = [
              + "discovery.k8s.io",
            ]
          + resources  = [
              + "endpointslices",
            ]
          + verbs      = [
              + "list",
              + "watch",
              + "get",
            ]
        }
    }

  # kubernetes_cluster_role_binding.ingress_nginx will be created
  + resource "kubernetes_cluster_role_binding" "ingress_nginx" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/name" = "ingress-nginx"
            }
          + name             = "ingress-nginx"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "ingress-nginx"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "ingress-nginx"
          + namespace = "ingress-nginx"
        }
    }

  # kubernetes_role.ingress_nginx will be created
  + resource "kubernetes_role" "ingress_nginx" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/name" = "ingress-nginx"
            }
          + name             = "ingress-nginx"
          + namespace        = "ingress-nginx"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "namespaces",
            ]
          + verbs      = [
              + "get",
            ]
        }
      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "configmaps",
              + "endpoints",
              + "pods",
              + "secrets",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "services",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
      + rule {
          + api_groups = [
              + "networking.k8s.io",
            ]
          + resources  = [
              + "ingresses",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
      + rule {
          + api_groups = [
              + "networking.k8s.io",
            ]
          + resources  = [
              + "ingresses/status",
            ]
          + verbs      = [
              + "update",
            ]
        }
      + rule {
          + api_groups = [
              + "networking.k8s.io",
            ]
          + resources  = [
              + "ingressclasses",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
      + rule {
          + api_groups = [
              + "coordination.k8s.io",
            ]
          + resources  = [
              + "leases",
            ]
          + verbs      = [
              + "create",
              + "delete",
              + "get",
              + "list",
              + "patch",
              + "update",
              + "watch",
            ]
        }
      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "configmaps",
            ]
          + verbs      = [
              + "create",
              + "delete",
              + "get",
              + "list",
              + "patch",
              + "update",
              + "watch",
            ]
        }
      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "events",
            ]
          + verbs      = [
              + "create",
              + "patch",
            ]
        }
      + rule {
          + api_groups = [
              + "discovery.k8s.io",
            ]
          + resources  = [
              + "endpointslices",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
    }

  # kubernetes_role_binding.ingress_nginx will be created
  + resource "kubernetes_role_binding" "ingress_nginx" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/name" = "ingress-nginx"
            }
          + name             = "ingress-nginx"
          + namespace        = "ingress-nginx"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Role"
          + name      = "ingress-nginx"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "ingress-nginx"
          + namespace = "ingress-nginx"
        }
    }

Plan: 17 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  + cloudwatch_dashboard_url      = "https://us-east-1.console.aws.amazon.com/cloudwatch/home?region=us-east-1#dashboards:name=TechChallenge-Dashboard"
  + cloudwatch_log_group_apps     = "/tech-challenge/applications"
  + cloudwatch_log_group_eks      = "/aws/eks/tech-challenge-cluster/cluster"
  + cloudwatch_logs_url           = "https://us-east-1.console.aws.amazon.com/cloudwatch/home?region=us-east-1#logsV2:log-groups"
  + eks_console_url               = "https://us-east-1.console.aws.amazon.com/eks/home?region=us-east-1#/clusters/tech-challenge-cluster"

Error: Unexpected Identity Change: During the read operation, the Terraform Provider unexpectedly returned a different identity then the previously stored one.

This is always a problem with the provider and should be reported to the provider developer.

Current Identity: cty.ObjectVal(map[string]cty.Value{"api_version":cty.NullVal(cty.String), "kind":cty.NullVal(cty.String), "name":cty.NullVal(cty.String), "namespace":cty.NullVal(cty.String)})

New Identity: cty.ObjectVal(map[string]cty.Value{"api_version":cty.StringVal("apps/v1"), "kind":cty.StringVal("Deployment"), "name":cty.StringVal("ingress-nginx-controller"), "namespace":cty.StringVal("ingress-nginx")})

  with kubernetes_deployment.ingress_nginx_controller,
  on ingress.tf line 229, in resource "kubernetes_deployment" "ingress_nginx_controller":
 229: resource "kubernetes_deployment" "ingress_nginx_controller" {

Releasing state lock. This may take a few moments...
::error::Terraform exited with code 1.

```

</details>

---
*Triggered by: @TheMyFish via `pull_request`*